{"class_name": "Model", "config": {"name": "model_23", "layers": [{"name": "input_49", "class_name": "InputLayer", "config": {"batch_input_shape": [null, null, null, 1], "dtype": "float32", "sparse": false, "name": "input_49"}, "inbound_nodes": []}, {"name": "conv2d_350", "class_name": "Conv2D", "config": {"name": "conv2d_350", "trainable": true, "dtype": "float32", "filters": 16, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "truncated_normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [["input_49", 0, 0, {}]]}, {"name": "batch_normalization_v2_350", "class_name": "BatchNormalizationV2", "config": {"name": "batch_normalization_v2_350", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [["conv2d_350", 0, 0, {}]]}, {"name": "activation_350", "class_name": "Activation", "config": {"name": "activation_350", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [["batch_normalization_v2_350", 0, 0, {}]]}, {"name": "conv2d_351", "class_name": "Conv2D", "config": {"name": "conv2d_351", "trainable": true, "dtype": "float32", "filters": 16, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "truncated_normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [["activation_350", 0, 0, {}]]}, {"name": "batch_normalization_v2_351", "class_name": "BatchNormalizationV2", "config": {"name": "batch_normalization_v2_351", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [["conv2d_351", 0, 0, {}]]}, {"name": "activation_351", "class_name": "Activation", "config": {"name": "activation_351", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [["batch_normalization_v2_351", 0, 0, {}]]}, {"name": "max_pooling2d_75", "class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_75", "trainable": true, "dtype": "float32", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "inbound_nodes": [["activation_351", 0, 0, {}]]}, {"name": "dropout_150", "class_name": "Dropout", "config": {"name": "dropout_150", "trainable": true, "dtype": "float32", "rate": 0.1, "noise_shape": null, "seed": null}, "inbound_nodes": [["max_pooling2d_75", 0, 0, {}]]}, {"name": "conv2d_352", "class_name": "Conv2D", "config": {"name": "conv2d_352", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "truncated_normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [["dropout_150", 0, 0, {}]]}, {"name": "batch_normalization_v2_352", "class_name": "BatchNormalizationV2", "config": {"name": "batch_normalization_v2_352", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [["conv2d_352", 0, 0, {}]]}, {"name": "activation_352", "class_name": "Activation", "config": {"name": "activation_352", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [["batch_normalization_v2_352", 0, 0, {}]]}, {"name": "conv2d_353", "class_name": "Conv2D", "config": {"name": "conv2d_353", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "truncated_normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [["activation_352", 0, 0, {}]]}, {"name": "batch_normalization_v2_353", "class_name": "BatchNormalizationV2", "config": {"name": "batch_normalization_v2_353", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [["conv2d_353", 0, 0, {}]]}, {"name": "activation_353", "class_name": "Activation", "config": {"name": "activation_353", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [["batch_normalization_v2_353", 0, 0, {}]]}, {"name": "max_pooling2d_76", "class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_76", "trainable": true, "dtype": "float32", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "inbound_nodes": [["activation_353", 0, 0, {}]]}, {"name": "dropout_151", "class_name": "Dropout", "config": {"name": "dropout_151", "trainable": true, "dtype": "float32", "rate": 0.1, "noise_shape": null, "seed": null}, "inbound_nodes": [["max_pooling2d_76", 0, 0, {}]]}, {"name": "conv2d_354", "class_name": "Conv2D", "config": {"name": "conv2d_354", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "truncated_normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [["dropout_151", 0, 0, {}]]}, {"name": "batch_normalization_v2_354", "class_name": "BatchNormalizationV2", "config": {"name": "batch_normalization_v2_354", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [["conv2d_354", 0, 0, {}]]}, {"name": "activation_354", "class_name": "Activation", "config": {"name": "activation_354", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [["batch_normalization_v2_354", 0, 0, {}]]}, {"name": "conv2d_355", "class_name": "Conv2D", "config": {"name": "conv2d_355", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "truncated_normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [["activation_354", 0, 0, {}]]}, {"name": "batch_normalization_v2_355", "class_name": "BatchNormalizationV2", "config": {"name": "batch_normalization_v2_355", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [["conv2d_355", 0, 0, {}]]}, {"name": "activation_355", "class_name": "Activation", "config": {"name": "activation_355", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [["batch_normalization_v2_355", 0, 0, {}]]}, {"name": "max_pooling2d_77", "class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_77", "trainable": true, "dtype": "float32", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "inbound_nodes": [["activation_355", 0, 0, {}]]}, {"name": "dropout_152", "class_name": "Dropout", "config": {"name": "dropout_152", "trainable": true, "dtype": "float32", "rate": 0.1, "noise_shape": null, "seed": null}, "inbound_nodes": [["max_pooling2d_77", 0, 0, {}]]}, {"name": "conv2d_356", "class_name": "Conv2D", "config": {"name": "conv2d_356", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "truncated_normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [["dropout_152", 0, 0, {}]]}, {"name": "batch_normalization_v2_356", "class_name": "BatchNormalizationV2", "config": {"name": "batch_normalization_v2_356", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [["conv2d_356", 0, 0, {}]]}, {"name": "activation_356", "class_name": "Activation", "config": {"name": "activation_356", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [["batch_normalization_v2_356", 0, 0, {}]]}, {"name": "conv2d_357", "class_name": "Conv2D", "config": {"name": "conv2d_357", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "truncated_normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [["activation_356", 0, 0, {}]]}, {"name": "batch_normalization_v2_357", "class_name": "BatchNormalizationV2", "config": {"name": "batch_normalization_v2_357", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [["conv2d_357", 0, 0, {}]]}, {"name": "activation_357", "class_name": "Activation", "config": {"name": "activation_357", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [["batch_normalization_v2_357", 0, 0, {}]]}, {"name": "conv2d_transpose_75", "class_name": "Conv2DTranspose", "config": {"name": "conv2d_transpose_75", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "output_padding": null}, "inbound_nodes": [["activation_357", 0, 0, {}]]}, {"name": "concatenate_75", "class_name": "Concatenate", "config": {"name": "concatenate_75", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["conv2d_transpose_75", 0, 0, {}], ["activation_355", 0, 0, {}]]]}, {"name": "dropout_153", "class_name": "Dropout", "config": {"name": "dropout_153", "trainable": true, "dtype": "float32", "rate": 0.1, "noise_shape": null, "seed": null}, "inbound_nodes": [["concatenate_75", 0, 0, {}]]}, {"name": "conv2d_358", "class_name": "Conv2D", "config": {"name": "conv2d_358", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "truncated_normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [["dropout_153", 0, 0, {}]]}, {"name": "batch_normalization_v2_358", "class_name": "BatchNormalizationV2", "config": {"name": "batch_normalization_v2_358", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [["conv2d_358", 0, 0, {}]]}, {"name": "activation_358", "class_name": "Activation", "config": {"name": "activation_358", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [["batch_normalization_v2_358", 0, 0, {}]]}, {"name": "conv2d_359", "class_name": "Conv2D", "config": {"name": "conv2d_359", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "truncated_normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [["activation_358", 0, 0, {}]]}, {"name": "batch_normalization_v2_359", "class_name": "BatchNormalizationV2", "config": {"name": "batch_normalization_v2_359", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [["conv2d_359", 0, 0, {}]]}, {"name": "activation_359", "class_name": "Activation", "config": {"name": "activation_359", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [["batch_normalization_v2_359", 0, 0, {}]]}, {"name": "conv2d_transpose_76", "class_name": "Conv2DTranspose", "config": {"name": "conv2d_transpose_76", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "output_padding": null}, "inbound_nodes": [["activation_359", 0, 0, {}]]}, {"name": "concatenate_76", "class_name": "Concatenate", "config": {"name": "concatenate_76", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["conv2d_transpose_76", 0, 0, {}], ["activation_353", 0, 0, {}]]]}, {"name": "dropout_154", "class_name": "Dropout", "config": {"name": "dropout_154", "trainable": true, "dtype": "float32", "rate": 0.1, "noise_shape": null, "seed": null}, "inbound_nodes": [["concatenate_76", 0, 0, {}]]}, {"name": "conv2d_360", "class_name": "Conv2D", "config": {"name": "conv2d_360", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "truncated_normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [["dropout_154", 0, 0, {}]]}, {"name": "batch_normalization_v2_360", "class_name": "BatchNormalizationV2", "config": {"name": "batch_normalization_v2_360", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [["conv2d_360", 0, 0, {}]]}, {"name": "activation_360", "class_name": "Activation", "config": {"name": "activation_360", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [["batch_normalization_v2_360", 0, 0, {}]]}, {"name": "conv2d_361", "class_name": "Conv2D", "config": {"name": "conv2d_361", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "truncated_normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [["activation_360", 0, 0, {}]]}, {"name": "batch_normalization_v2_361", "class_name": "BatchNormalizationV2", "config": {"name": "batch_normalization_v2_361", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [["conv2d_361", 0, 0, {}]]}, {"name": "activation_361", "class_name": "Activation", "config": {"name": "activation_361", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [["batch_normalization_v2_361", 0, 0, {}]]}, {"name": "conv2d_transpose_77", "class_name": "Conv2DTranspose", "config": {"name": "conv2d_transpose_77", "trainable": true, "dtype": "float32", "filters": 16, "kernel_size": [3, 3], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "output_padding": null}, "inbound_nodes": [["activation_361", 0, 0, {}]]}, {"name": "concatenate_77", "class_name": "Concatenate", "config": {"name": "concatenate_77", "trainable": true, "dtype": "float32", "axis": 3}, "inbound_nodes": [[["conv2d_transpose_77", 0, 0, {}], ["activation_351", 0, 0, {}]]]}, {"name": "dropout_155", "class_name": "Dropout", "config": {"name": "dropout_155", "trainable": true, "dtype": "float32", "rate": 0.1, "noise_shape": null, "seed": null}, "inbound_nodes": [["concatenate_77", 0, 0, {}]]}, {"name": "conv2d_362", "class_name": "Conv2D", "config": {"name": "conv2d_362", "trainable": true, "dtype": "float32", "filters": 16, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "truncated_normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [["dropout_155", 0, 0, {}]]}, {"name": "batch_normalization_v2_362", "class_name": "BatchNormalizationV2", "config": {"name": "batch_normalization_v2_362", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [["conv2d_362", 0, 0, {}]]}, {"name": "activation_362", "class_name": "Activation", "config": {"name": "activation_362", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [["batch_normalization_v2_362", 0, 0, {}]]}, {"name": "conv2d_363", "class_name": "Conv2D", "config": {"name": "conv2d_363", "trainable": true, "dtype": "float32", "filters": 16, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "truncated_normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [["activation_362", 0, 0, {}]]}, {"name": "batch_normalization_v2_363", "class_name": "BatchNormalizationV2", "config": {"name": "batch_normalization_v2_363", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [["conv2d_363", 0, 0, {}]]}, {"name": "activation_363", "class_name": "Activation", "config": {"name": "activation_363", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [["batch_normalization_v2_363", 0, 0, {}]]}, {"name": "predictions", "class_name": "Conv2D", "config": {"name": "predictions", "trainable": true, "dtype": "float32", "filters": 1, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [["activation_363", 0, 0, {}]]}, {"name": "confidence", "class_name": "Conv2D", "config": {"name": "confidence", "trainable": true, "dtype": "float32", "filters": 1, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [["activation_363", 0, 0, {}]]}], "input_layers": ["input_49", 0, 0], "output_layers": [["predictions", 0, 0], ["confidence", 0, 0]]}, "keras_version": "2.2.4-tf", "backend": "tensorflow"}